---
layout: post
title:  "Growth Log #2"
date:   2024-06-12 00:00:00 +0900
categories: jekyll update
discussion_id: 2024-06-12-growthlog
---

<style>
    figure {
      display: block;
      text-align: center;
    }
</style>

지난주 근무처가 이전하면서 대규모의 사무실 정리가 있었다.

정리 중에 폐기되는 일부 장비들 중 스위치로 보여지는 장비가 있어 개인적으로 사용하고자 인수 받아 집으로 가져왔고, 집에 가져와서야 해당 장비가 스위치가 아니고 **NGFW**임을 알게 되었다. *"아이템 등급이 상향되었습니다. Yay~"*

<figure>
  <img src="{{"/assets/img/2.jpg" | relative_url}}" alt="Axgate 80D" style="width:100%">
  <figcaption >Axgate 80D</figcaption>
</figure>

<br>

더 좋은 장비를 득했다는 기쁜 마음으로 당장 쿠팡에서 콘솔케이블을 주문했고 Putty를 이용하여 Serial Console에 접속해보았지만 아무것도 출력되지 않았다. *내가 지독한 **네알못**임을 망각하고 있었다...*

<figure>
  <img src="{{"/assets/img/3.jpg" | relative_url}}" alt="USB 2.0 to RS232(RJ45)" style="width:100%">
  <figcaption>USB 2.0 to RS232(RJ45)</figcaption>
</figure>

<br>

다음날 해당 Vendor 사에 사용법에 대해 직접 문의해봤지만 계약 당사자가 아니면 가르쳐 줄 수 없다는 회신이 전부였다. *매뉴얼도 줄 수 없다고 한다... 그래도 포트 전송 속도는 가르쳐주셔서 그나마의 노가다를 줄이고 진행이 가능했다...*

<figure>
  <img src="{{"/assets/img/4.jpg" | relative_url}}" alt="콘솔케이블을 이용하여 컴퓨터와 NGFW를 연결한 모습" style="width:100%">
  <figcaption>콘솔케이블을 이용하여 컴퓨터와 NGFW를 연결한 모습</figcaption>
</figure>

<br>

그래서 열심히 구글링(*과 끝없는 삽질*)해 본 결과... 계정을 생성하여 Web UI를 통해 세팅할 수 있는 단계까지 해결할 수 있었다! *"**콘솔에서 알파벳마다 탭을 눌러가며 무슨 명령어가 있는지 확인하는 극한의 노가다**로부터 해방되었습니다. Hooray~"*

<br>

내구성이 좋은 나의 삽으로 처음 길을 잘 정비하여 다시는 삽을 잡지 않기 위해 해당 포스트를 정리했다. *왜 내 삽은 한 없이 튼튼해져 가는가...*

<br>

---

### Axgate NGFW 초기 설정 방법
1. 콘솔케이블을 연결 후 디바이스 검색이 되는지 확인

    <figure>
      <img src="{{"/assets/img/5.png" | relative_url}}" alt="디바이스 검색이 안된다면 장치관리자에서 다운로드/업로드 필요" style="width:100%">
      <figcaption>디바이스 검색이 안된다면 장치관리자에서 다운로드/업로드 필요</figcaption>
    </figure>
<br>

2. `Windows` + `R` 에서 **devmgmt.msc**를 입력 (장치관리자)

    <figure>
      <img src="{{"/assets/img/6.png" | relative_url}}" alt="실행 창" style="width:100%">
      <figcaption>실행 창</figcaption>
    </figure>
<br>

3. 장치관리자에서 시리얼 포트를 찾아 더블클릭(*또는 오른쪽 마우스 클릭*)

    <figure>
      <img src="{{"/assets/img/8.png" | relative_url}}" alt="장치관리자 화면" style="width:100%">
      <figcaption>장치관리자 화면</figcaption>
    </figure>
<br>

4. 장비에 맞는 전송 속도 및 기타 포트 설정값 선택 (*각 설정값은 장비에 종속적이다*)

    <figure>
      <img src="{{"/assets/img/9.png" | relative_url}}" alt="포트 설정 화면" style="width:100%">
      <figcaption>포트 설정 화면</figcaption>
    </figure>
<br>

5. [Putty](https://www.putty.org) > **Serial**에 **장치관리자에서 설정한 포트 설정값**을 세팅 (*[Windows PowerShell에서 명령어를 통해 하는 콘솔을 다룰 수 있는 방법](https://stackoverflow.com/a/48661245)이 있다는데 해보지 않았다*)

    <figure>
      <img src="{{"/assets/img/10.png" | relative_url}}" alt="Putty Serial 설정 화면" style="width:100%">
      <figcaption>Putty Serial 설정 화면</figcaption>
    </figure>
<br>

6. *5번*의 방법으로 **Open** 클릭이 안되면 **Session**에서 **Open** 클릭

    <figure>
      <img src="{{"/assets/img/11.png" | relative_url}}" alt="Putty Session 설정 화면" style="width:100%">
      <figcaption>Putty Session 설정 화면</figcaption>
    </figure>
<br>

7. 창이 열리고 나서 장비를 껐다 켜보면 부팅 상황이 콘솔에 출력

    <figure>
      <img src="{{"/assets/img/12.png" | relative_url}}" alt="콘솔 화면" style="width:100%">
      <figcaption>콘솔 화면</figcaption>
    </figure>
<br>

8. 해당 화면까지 진행되면 계정을 입력

    <figure>
      <img src="{{"/assets/img/13.png" | relative_url}}" alt="계정 입력" style="width:100%">
      <figcaption>계정 입력</figcaption>
    </figure>
<br>

9. 계정이 없거나 잃어버린 경우 재부팅한 후 **autoboot가 되기 전에** `Ctrl` + `C`를 눌러 octeon mode으로 진입

    ```shell
    > run bootrecovery
    ```
    <figure>
      <img src="{{"/assets/img/14.png" | relative_url}}" alt="octeon mode" style="width:100%">
      <figcaption>octeon mode</figcaption>
    </figure>
<br>

10. 계정이 있으면 해당 계정으로 로그인, 또는 9번을 실행한 상태에서 커맨드 입력

    ```shell
    > regain privilege
    > conf t
    # privilege 15: superuser
    > username USERNAME privilege 15 password PASSWORD
    > end
    > write
    > reboot
    ```
    <figure>
      <img src="{{"/assets/img/15.png" | relative_url}}" alt="계정 생성" style="width:100%">
      <figcaption>계정 생성</figcaption>
    </figure>
<br>

11. 향후 장비 접속/관리를 위해 아래 커맨드를 입력 (설정하는 이더넷 포트에 랜선이 제대로 연결되어 있는지 확인)

    ```shell
    > regain privilege
    > conf t
    > line vty
    > login server priority local
    # all ports are available except well-known ports
    > telnet port 2333
    > ssh port 2222
    > http port 8000
    > http secure-port 4433
    > exit
    # I failed to set eth0
    # interface eth0
    # ip address xxx.xxx.xxx.xxx/24
    # exit
    > interface eth1
    > ip address xxx.xxx.xxx.xxx/24
    > no shutdown
    > end
    > write
    ```
    <figure>
      <img src="{{"/assets/img/16.png" | relative_url}}" alt="설정 저장" style="width:100%">
      <figcaption>설정 저장</figcaption>
    </figure>
<br>

12. *11번*에서 세팅하는 ip 주소는 **CMD**에서 **ipconfig**로 확인하여 주소 할당

    <figure>
        <img src="{{"/assets/img/17.png" | relative_url}}" alt="ipconfig" style="width:100%">
        <figcaption>ipconfig</figcaption>
    </figure>
    <figure>
        <img src="{{"/assets/img/18.png" | relative_url}}" alt="ip 주소 할당" style="width:100%">
        <figcaption>ip 주소 할당</figcaption>
    </figure>
<br>

13. *11번*에서 설정한 **http 포트**와 **ip 주소**로 접속 

    <figure>
      <img src="{{"/assets/img/19.png" | relative_url}}" alt="Web UI 로그인 화면" style="width:100%">
      <figcaption>Web UI 로그인 화면</figcaption>
    </figure>
<br>

14. 계정을 입력하여 로그인

    <figure>
      <img src="{{"/assets/img/20.png" | relative_url}}" alt="계정 입력" style="width:100%">
      <figcaption>계정 입력</figcaption>
    </figure>
<br>

15. Web UI를 통해 장비를 설정

    <figure>
      <img src="{{"/assets/img/21.png" | relative_url}}" alt="Web UI 모니터링 화면" style="width:100%">
      <figcaption>Web UI 모니터링 화면</figcaption>
    </figure>

---

<br>

기회가 된다면 다음에는 Web UI에서 F/W, VPN 등을 설정하는 방법을 포스팅해야겠다.